## Setup

#### Import Packages

In [2]:
import pandas as pd
import numpy as np
from scipy import stats
import seaborn as sns
sns.set_theme()
import pickle
import matplotlib.pyplot as plt
%matplotlib inline
from statsmodels.formula.api import ols
from sklearn.model_selection import cross_val_score
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.linear_model import LinearRegression
from sklearn.feature_selection import SelectKBest, f_regression, mutual_info_regression
from sklearn.feature_selection import RFECV
from sklearn.model_selection import train_test_split
from sklearn import metrics
from sklearn.preprocessing import PolynomialFeatures
from sklearn.preprocessing import StandardScaler

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 30)

#### Reading in CSV to DataFrame

In [3]:
df = pd.read_csv('data/holdout_data.csv', index_col = 0)

In [4]:
df.head()

,X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23
5501,180000,2,2,1,44,0,0,0,0,0,0,161186,167080,170788,174764,162667,166953,10000,8000,7000,6000,7000,10000
28857,130000,2,2,1,48,-2,-2,-2,-2,-2,-2,0,1240,1487,1279,749,440,1240,1487,1279,749,440,849
11272,60000,2,1,1,43,-1,3,2,0,0,-1,495,330,495,330,165,340,0,330,0,0,340,0
8206,240000,1,1,1,42,0,0,0,0,0,0,72339,91045,91027,51508,51127,0,20000,2213,1030,1023,6790,10893
6362,100000,2,2,1,28,2,0,0,0,0,2,73073,74739,70844,63924,57326,59654,3500,3003,1910,2400,3300,0

## Data Cleaning

First, I inspect the training dataset for null-values and the datatypes of values.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7501 entries, 5501 to 10111
Data columns (total 23 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      7501 non-null   int64
 1   X2      7501 non-null   int64
 2   X3      7501 non-null   int64
 3   X4      7501 non-null   int64
 4   X5      7501 non-null   int64
 5   X6      7501 non-null   int64
 6   X7      7501 non-null   int64
 7   X8      7501 non-null   int64
 8   X9      7501 non-null   int64
 9   X10     7501 non-null   int64
 10  X11     7501 non-null   int64
 11  X12     7501 non-null   int64
 12  X13     7501 non-null   int64
 13  X14     7501 non-null   int64
 14  X15     7501 non-null   int64
 15  X16     7501 non-null   int64
 16  X17     7501 non-null   int64
 17  X18     7501 non-null   int64
 18  X19     7501 non-null   int64
 19  X20     7501 non-null   int64
 20  X21     7501 non-null   int64
 21  X22     7501 non-null   int64
 22  X23     7501 non-null   int64
dtypes: int64(23)
memory usage: 1.7 MB

In [11]:
df.education.value_counts()

2    3514
1    2666
3    1204
5      72
4      33
6       9
0       3
Name: education, dtype: int64

In [8]:
# CLEANING: setting column names to match features from training dataset
df.columns = ['limit_bal', 'sex', 'education', 'marriage', 'age', 'pay_0', 'pay_2', 'pay_3', 'pay_4', 'pay_5', 'pay_6', 'bill_amt1', 'bill_amt2', 'bill_amt3', 'bill_amt4', 'bill_amt5', 'bill_amt6', 'pay_amt1', 'pay_amt2', 'pay_amt3', 'pay_amt4', 'pay_amt5', 'pay_amt6']

# CLEANING/Pseudo FE: changing 'gender' column to male dummy variable
df['sex'] = np.where(df.sex == 2, 
                     0, 
                     df.sex)
df.rename(columns={'sex':'male'})